////////////////////////////////////////////////////////////////////////////////
// ДеньгиКлиент: Общий фунционал конфигурации 1С:Деньги
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму обработки ОбзорОсновныхВозможностей
//	
//Параметры:
//	РазделПодсказки - <Строка> - имя раздела, для которого нужно открыть подсказку
//	Форма - <Форма> - форма, из которой открывают подсказку
Процедура ОткрытьПодсказку(РазделПодсказки, Форма = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(РазделПодсказки) Тогда
		Возврат;
	КонецЕсли; 

	ОткрытьФорму("Обработка.ОбзорОсновныхВозможностей.Форма." + РазделПодсказки, , Форма);
	
КонецПроцедуры

// Проверяет, является ли оповещение результатом удаления помеченных объектов
//
//Параметры:
//	ИмяСобытия- Строка - см. ОбработкаОповещения()
//	Параметр- произволный - см. ОбработкаОповещения()
//	Источник- Произвольный - см. ОбработкаОповещения()
//
//Возвращаемое значение:
//	Булево - Истина, если это удаление помеченных
//
Функция ЭтоОповещениеОбУдаленииПомеченных(ИмяСобытия, Параметр, Источник) Экспорт

	Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("УдалениеПомеченных") Тогда
		Возврат Параметр.УдалениеПомеченных = Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

// Открывает инструкцию из макета во внешнем браузере
//
//Параметры:
//	ИмяМакета    - Строка - имя макета открываемой инструкции
//	ИмяОбработки - Строка - имя обработки, из которой нужно получить макет
//	КаталогИнструкций - Строка - каталог, в который выгружаются макеты
//
Процедура ОткрытьМакетВоВнешнемБраузере(ИмяМакета, ИмяОбработки, КаталогИнструкций = "") Экспорт
	
	#Если Не ВебКлиент Тогда

	Если Не ЗначениеЗаполнено(КаталогИнструкций) Тогда
		КаталогИнструкций = КаталогИнструкций();
	КонецЕсли;
	ИмяФайлаИнструкции = КаталогИнструкций + ИмяМакета + ПолучитьРазделительПутиКлиента() + ИмяМакета + ".htm";
	
	Файл = Новый Файл(ИмяФайлаИнструкции);
	Если НЕ Файл.Существует() ИЛИ НЕ Файл.ЭтоФайл() ИЛИ Файл.ПолучитьВремяИзменения() < НачалоЧаса(ТекущаяДата()) Тогда
		ИмяФайлаИнструкции = ДневникВызовСервера.РаспаковатьФайлыИнструкции(КаталогИнструкций, ИмяМакета, ИмяОбработки);
		Если ИмяФайлаИнструкции = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru='Извините, эта инструкция не найдена в текущей версии программы'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяФайлаИнструкции = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Извините, эта инструкция не найдена в текущей версии программы'"));
		Возврат;
	ИначеЕсли ИмяФайлаИнструкции = "" Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не удалось распаковать файл инструкции.'"));
		Возврат;
	КонецЕсли;
	
	ЗапуститьПриложение(ИмяФайлаИнструкции);
	
	#КонецЕсли

КонецПроцедуры


#КонецОбласти



#Область СлужебныеПроцедурыИФункции


Функция КаталогИнструкций()

	Разделитель = ПолучитьРазделительПутиКлиента();
	КаталогВсехИнструкций = КаталогВременныхФайлов();
	КаталогВсехИнструкций = КаталогВсехИнструкций + ?(Прав(КаталогВсехИнструкций, 1) = Разделитель, "", Разделитель) + "MoneyTutorials.tmp";
	Возврат КаталогВсехИнструкций;

КонецФункции


#КонецОбласти
