
#Область ПрограммныйИнтерфейс

Процедура ПоказатьВыборШаблонаДляСозданияДокументаИзСписка(Знач ПолноеИмяОбъектаМетаданных, Знач ЭлементыОтбораДинамическогоСписка, Знач ДокументСсылка, Знач ИсключитьТипы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	ПараметрыФормы.Вставить("ВидыОпераций", СписокВидовОперацийДляОтбора(ЭлементыОтбораДинамическогоСписка));
	ПараметрыФормы.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыФормы.Вставить("ИсключитьТипы", ИсключитьТипы);
	
	ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаВыбора", ПараметрыФормы);
	
КонецПроцедуры

Процедура СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты, ОписаниеОповещения) Экспорт
	
	Если ТипЗнч(ОписаниеОповещения) = Тип("ОписаниеОповещения") Тогда
		
		ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаОбъекта",
		Новый Структура("Объект, ОтображаемыеРеквизиты", Объект, ОтображаемыеРеквизиты),,,,,
		ОписаниеОповещения);
		
	Иначе
		
		ОткрытьФорму("Справочник.ШаблоныДокументов.ФормаОбъекта",
		Новый Структура("Объект, ОтображаемыеРеквизиты", Объект, ОтображаемыеРеквизиты));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСкладВСтрокеТЧЗапасы(Знач СтрокаТЧЗапасы, Знач ДокументОбъект, Знач ДанныеНоменклатуры) Экспорт
	
	Если Не ЗначениеЗаполнено(СтрокаТЧЗапасы.СтруктурнаяЕдиница) Тогда
		СтрокаТЧЗапасы.СтруктурнаяЕдиница = ДокументОбъект.СтруктурнаяЕдиница;
		Если СтрокаТЧЗапасы.Свойство("Ячейка") Тогда
			СтрокаТЧЗапасы.Ячейка = ДокументОбъект.Ячейка;
		КонецЕсли; 
	КонецЕсли;
	
	Если ТипЗнч(ДанныеНоменклатуры) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеНоменклатуры.Свойство("Склад") И ЗначениеЗаполнено(ДанныеНоменклатуры.Склад) Тогда
		СтрокаТЧЗапасы.СтруктурнаяЕдиница = ДанныеНоменклатуры.Склад;
	КонецЕсли;
	
	Если ДанныеНоменклатуры.Свойство("Ячейка") И ЗначениеЗаполнено(ДанныеНоменклатуры.Ячейка) И СтрокаТЧЗапасы.Свойство("Ячейка") Тогда
		СтрокаТЧЗапасы.Ячейка = ДанныеНоменклатуры.Ячейка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокВидовОперацийДляОтбора(ЭлементыОтбораДинамическогоСписка)
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ТекЭлементОтбора Из ЭлементыОтбораДинамическогоСписка Цикл
		
		Если Не ТекЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлементОтбора.ЛевоеЗначение <> Новый ПолеКомпоновкиДанных("ВидОперации") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			Результат.Добавить(ТекЭлементОтбора.ПравоеЗначение);
			Возврат Результат;
		КонецЕсли;
		
		Если ТекЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			Результат.ЗагрузитьЗначения(ТекЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения());
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти