
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектАвтор = Объект.Автор; 
	Если НЕ ЗначениеЗаполнено(ОбъектАвтор) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Создан) Тогда
			Объект.Создан = ТекущаяДата();
		КонецЕсли;	
	КонецЕсли; 
	
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(УсловноеОформление.Элементы, "Объект.Диалог.Выделить", ВидСравненияКомпоновкиДанных.Равно, Истина, "Диалог", "ДиалогВыделить",,, Истина);
	
КонецПроцедуры
