
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	лДатаНачалаЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
	
	ТекДата 	= ТекущаяДата();
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата 			= ТекДата;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончание) Тогда
		Объект.ДатаОкончание 	= ТекДата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		СоздатьЭлементыРасширенногоВвода();
		КлючСохраненияПоложенияОкна = "РасширенныйВвод";
	КонецЕсли;
	
	СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.НачалоВремя);
	СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.ОкончаниеВремя);
	
	лЗначенияЗаполнения 	= Параметры.ЗначенияЗаполнения;
	Если ЗначениеЗаполнено(лЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения); //Хотя передаётся типовым методом, само не заполняется
		
		Если лЗначенияЗаполнения.Свойство("ДанныеЗаписиКалендаря") Тогда
			лДанныеЗаписиКалендаря 	= лЗначенияЗаполнения.ДанныеЗаписиКалендаря;
			Если ЗначениеЗаполнено(лДанныеЗаписиКалендаря) Тогда
				ЗаполнитьЗначенияСвойств(Объект, лДанныеЗаписиКалендаря); 
				
				Если ЗначениеЗаполнено(лДанныеЗаписиКалендаря.ЗаписьКалендаря) Тогда
					Объект.Основание 	= лДанныеЗаписиКалендаря.ЗаписьКалендаря;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.Основание.Видимость 	= ЗначениеЗаполнено(Объект.Основание); 
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(Справочники.КлючевыеОперации.СозданиеПростойФормыДневника, лДатаНачалаЗамера);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыРасширенногоВвода()
	
	ЗначениеВРеквизитФормы(Справочники.ЗаписиКалендаряСотрудника.ОписаниеРасширенногоВводаЗаписей(), "ОписаниеРасширенногоВвода");
	
	Для Индекс = 0 По ОписаниеРасширенногоВвода.Количество()-1 Цикл
		
		СтрокаОписания = ОписаниеРасширенногоВвода[Индекс];
		
		ГруппаРодитель = ?(Индекс <= ОписаниеРасширенногоВвода.Количество() / 2, Элементы.Колонка_1, Элементы.Колонка_2);
		
		ИмяЭлемента = "ВводТипа_" + Индекс;
		ДекорацияНадпись = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаРодитель);
		ДекорацияНадпись.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияНадпись.Заголовок = СтрокаОписания.Представление;
		ДекорацияНадпись.Гиперссылка = Истина;
		ДекорацияНадпись.УстановитьДействие("Нажатие", "Подключаемый_ВводТипаНажатие");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВводТипаНажатие(Элемент)
	
	ДанныеЗаписиКалендаря = Новый Структура;
	ДанныеЗаписиКалендаря.Вставить("Наименование",	Объект.Описание);
	ДанныеЗаписиКалендаря.Вставить("Календарь",		Объект.Календарь);
	ДанныеЗаписиКалендаря.Вставить("Начало",		Объект.Дата);
	ДанныеЗаписиКалендаря.Вставить("Окончание",		Объект.ДатаОкончание);
	ДанныеЗаписиКалендаря.Вставить("Описание",		Объект.Описание);
	
	Индекс = Число(Сред(Элемент.Имя, СтрДлина("ВводТипа_")+1));
	СтрокаОписания = ОписаниеРасширенногоВвода[Индекс];
	
	Если Не СтрокаОписания.ПараметрыФормы.Свойство("ЗначенияЗаполнения") Тогда
		СтрокаОписания.ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура);
	КонецЕсли;
	
	СтрокаОписания.ПараметрыФормы.ЗначенияЗаполнения.Вставить("ДанныеЗаписиКалендаря", ДанныеЗаписиКалендаря);
	
	ОткрытьФорму(СтрокаОписания.ИмяФормы, СтрокаОписания.ПараметрыФормы);
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Элементы.Основание.Видимость 	= ЗначениеЗаполнено(Объект.Основание);
	
	Оповестить("Запись_ИсточникЗаписейКалендаряСотрудника");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	лДата 		= Объект.Дата;
	лНоваяДата 	= Дата(Год(лДата), Месяц(лДата), День(лДата), Час(ВыбранноеЗначение), Минута(ВыбранноеЗначение), Секунда(ВыбранноеЗначение));
	ВыбранноеЗначение = лНоваяДата;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	лДата 		= Объект.ДатаОкончание;
	лНоваяДата 	= Дата(Год(лДата), Месяц(лДата), День(лДата), Час(ВыбранноеЗначение), Минута(ВыбранноеЗначение), Секунда(ВыбранноеЗначение));
	ВыбранноеЗначение = лНоваяДата;
КонецПроцедуры

&НаКлиенте
Функция ИзменитьВремяТаблиц(пЭлементТекущиеДанные)

	лРезультат = Ложь;
	
	Если пЭлементТекущиеДанные <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(пЭлементТекущиеДанные.Время) Тогда
			пЭлементТекущиеДанные.Время = Объект.Дата;
			лРезультат = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат лРезультат;

КонецФункции // ИзменитьВремяТаблиц()

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	лЭлементТекущиеДанные 	= Элемент.ТекущиеДанные;
	ИзменитьВремяТаблиц(лЭлементТекущиеДанные);
КонецПроцедуры
