////////////////////////////////////////////////////////////////////////////////
// ДеньгиВызовСервераПовтИсп: Общий фунционал конфигурации 1С:Деньги
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если используется интерфейс Такси
Функция ИспользуетсяВариантИнтерфейсаТакси() Экспорт

	ПравильныйВариантИнтерфейса = Вычислить("ВариантИнтерфейсаКлиентскогоПриложения.Такси");
	Если ПравильныйВариантИнтерфейса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ПравильныйВариантИнтерфейса;
	
КонецФункции

Функция ВерсияПлатформы835() Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.5.0") > 0;

КонецФункции

Функция ПланыОбменаБСП() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("МобильноеПриложение");
	
	Возврат Результат;

КонецФункции
 

#КонецОбласти




 
