#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СведенияОПользователе(Команда)
	
	ПоказатьЗначение(, АвторизованныйПользователь);
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаСервере();
	Оповестить("Изменилась настройка", Новый Структура("ПриЗапускеОткрыватьРаздел,ОсновнойКошелек", ПриЗапускеОткрыватьРаздел, ОсновнойКошелек));
	Закрыть();
	
КонецПроцедуры
 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
	
	ВыполнитьПроверкуПравДоступа("СохранениеДанныхПользователя", Метаданные);
	
	ПредлагатьПерейтиНаСайтПриЗапуске = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		"ПредлагатьПерейтиНаСайтПриЗапуске",
		Ложь);

	// СтандартныеПодсистемы.БазоваяФункциональность
	Если ЭтоВебКлиент Тогда
		Элементы.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы.Видимость = Ложь;
	КонецЕсли;
	
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// СтандартныеПодсистемы.Пользователи
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	Элементы.СведенияОПользователе.Заголовок = АвторизованныйПользователь;
	// Конец СтандартныеПодсистемы.Пользователи
	
	ПрочитатьНастройкиПользователя();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиПользователя()

	// СтандартныеПодсистемы.БазоваяФункциональность
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// ДЕНЬГИ
	
	// Общие настройки пользователя
	ПриЗапускеОткрыватьРаздел     = ПользовательскиеНастройкиДневникСервер.ПриЗапускеОткрыватьРаздел();
	СпособОткрытияФормОбъектов    = ПользовательскиеНастройкиДневникСервер.СпособОткрытияФорм();
	ТипДатыНовойОперации          = ПользовательскиеНастройкиДневникСервер.ТипДатыНовойОперации();
	
	// Значения по умолчанию
	ОсновнойКошелек   = ПользовательскиеНастройкиДневникСервер.ОсновнойКошелек();
	ОсновнойКонтакт   = ПользовательскиеНастройкиДневникСервер.ОсновнойКонтакт();
	ОсновноеИмущество = ПользовательскиеНастройкиДневникСервер.ОсновноеИмущество();
	
	// Конец ДЕНЬГИ

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбщиеНастройкиПользователя", "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", ЗапрашиватьПодтверждениеПриЗавершенииПрограммы);
	
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// ДЕНЬГИ
	
	// Общие настройки пользователя
	ПользовательскиеНастройкиДневникСервер.ЗаписатьПриЗапускеОткрыватьРаздел(ПриЗапускеОткрыватьРаздел);
	ПользовательскиеНастройкиДневникСервер.ЗаписатьСпособОткрытияФорм(СпособОткрытияФормОбъектов);
	ПользовательскиеНастройкиДневникСервер.ЗаписатьТипДатыНовойОперации(ТипДатыНовойОперации);
	
	// Значения по умолчанию
	ПользовательскиеНастройкиДневникСервер.ЗаписатьОсновнойКошелек(ОсновнойКошелек);
	ПользовательскиеНастройкиДневникСервер.ЗаписатьОсновнойКонтакт(ОсновнойКонтакт);
	ПользовательскиеНастройкиДневникСервер.ЗаписатьОсновноеИмущество(ОсновноеИмущество);
	
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменилась настройка" И Параметр.Свойство("ПриЗапускеОткрыватьРаздел") Тогда
		ЕстьМодифицированность = Модифицированность;
		ПриЗапускеОткрыватьРаздел =  Параметр.ПриЗапускеОткрыватьРаздел;
		Модифицированность = ЕстьМодифицированность;
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти


