
#Область ПрограммныйИнтерфейс

// Определяет правила для установки предопределённых элементов справочника СтруктурныеЕдиницы,
// для документа указанного типа в модуле ЗаполнениеОбъектов.
// Предопределенные элементы устанавливаются, если не удалось определить значения из настроек.
//
// Параметры:
//  Правила	 - Соответствие - в качестве ключа указать тип заполняемого объекта,
//                            в качестве значения - предопределенный элемент справочника СтруктурныеЕдиницы
//
Процедура ПриОпределенииПравилУстановкиСтруктурныхЕдиниц(Правила) Экспорт
	
	Правила[Тип("ДокументОбъект.ДоговорКредитаИЗайма")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.ЗаданиеНаРаботу")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.ЗаказНаПроизводство")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.ЗаказПоставщику")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.НачислениеЗарплаты")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.ПланПродаж")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.ПлатежнаяВедомость")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.ПрочиеРасходы")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.РаспределениеЗатрат")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.СборкаЗапасов")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.СдельныйНаряд")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.СписаниеПроданныхПодарочныхСертификатов")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.Табель")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	Правила[Тип("ДокументОбъект.УчетВремени")] = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
	
	Правила[Тип("ДокументОбъект.ДополнительныеРасходы")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ИнвентаризацияЗапасов")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ОприходованиеЗапасов")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ОтчетОПереработке")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ОтчетПереработчика")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПеремещениеЗапасов")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПеремещениеПоЯчейкам")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПересортицаЗапасов")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПриемИПередачаВРемонт")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПринятиеКУчетуВА")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПриходнаяНакладная")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.ПриходныйОрдер")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.РасходнаяНакладная")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.РасходныйОрдер")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.РасходыПриИмпорте")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	Правила[Тип("ДокументОбъект.СписаниеЗапасов")] = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	
КонецПроцедуры

// Дополнение списка включаемых в шаблон реквизитов, для всех документов.
//
// Параметры:
//  Реквизиты	 - Массив - массив строк, содержащий имена реквизитов, обязательных для использования
//                          в шаблонах для всех видов документов.
//
Процедура ПриОпределенииРеквизитовВключаемыхВШаблонДляВсехДокументов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("ВидОперации");
	Реквизиты.Добавить("ВидЦен");
	Реквизиты.Добавить("ВидЦенКонтрагента");
	Реквизиты.Добавить("ВидСкидкиНаценки");
	Реквизиты.Добавить("ДисконтнаяКарта");
	Реквизиты.Добавить("Договор");
	Реквизиты.Добавить("НалогообложениеНДС");
	Реквизиты.Добавить("СуммаВключаетНДС");
	Реквизиты.Добавить("ТипСобытия");
	
КонецПроцедуры

Функция ИсключениеИменРеквизитовПриСопоставленииПоТипу() Экспорт
	
	ИменаИсключаемыхРеквизитов = Новый Массив;
	ИменаИсключаемыхРеквизитов.Добавить("ОснованиеПечатиСсылка");
	
	Возврат ИменаИсключаемыхРеквизитов;
	
КонецФункции

#КонецОбласти
