
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Узел", Узел);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗарегистрированныеОбъекты, "Узел", Узел);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура УдалитьРегистрациюИзменений(Команда)
	
	УдалитьРегистрациюИзмененийНаСервере(Узел);
	Элементы.ЗарегистрированныеОбъекты.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УдалитьРегистрациюИзмененийНаСервере(Узел)
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрированныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элементы.ЗарегистрированныеОбъекты.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти