#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	//+++ 
	лТекущийПользователь 						= ПолучитьТекущегоПользователя();
	ПараметрыСеанса.ТекущийПользователь 		= лТекущийПользователь;
	//ПараметрыСеанса.ТекущийВнешнийПользователь 	= лТекущийПользователь;
	
	ИнфоСистемы 								= дОбщиеФункцииСервер.ПолучитьИнфоСистемы();
	ПараметрыСеанса.дИмяПользователяСистемы  	= ИнфоСистемы.ИмяПользователяСистемы;
	ПараметрыСеанса.дИмяКомпьютераСистемы 		= ИнфоСистемы.ИмяКомпьютераСистемы;
	ПараметрыСеанса.дИмяДоменаПользователя 		= ИнфоСистемы.ИмяДоменаПользователя;
	//--- 
	
КонецПроцедуры

Функция ПолучитьТекущегоПользователя() Экспорт
	
	ИдПользователя 		= ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ИдПользователя);
	
	Возврат ТекущийПользователь;
	
КонецФункции 

#КонецОбласти

#КонецЕсли