
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбластьДоступа", ПредопределенноеЗначение("Перечисление.ОбластиДоступаGoogle.Календарь"));
	
	ОткрытьФорму("Обработка.ОбменСGoogle.Форма.ВыполнитьОбменСGoogle",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры
