
&НаКлиенте
Процедура ПеренестиВЗапись(Команда)
	
	Закрыть(ПодготовитьРезультатКПереносуВЗапись(ВладелецФормы.УникальныйИдентификатор));
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьРезультатКПереносуВЗапись(ИДВладельца)

	АдресТаблицы = ПоместитьВоВременноеХранилище(Результаты.Выгрузить(), ИДВладельца);
	Результат = Новый Структура("АдресТаблицыВыбора", АдресТаблицы);
	
	Возврат Результат;

КонецФункции


&НаКлиенте
Процедура СписокИсторииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборСтрокиСпискаИстории();
	
КонецПроцедуры

Процедура ДобавитьРезультатВСписок(СтруктураВыбора)

	НоваяСтрока 				= Результаты.Добавить();
	Для каждого СтруктураВыбораСтрока Из СтруктураВыбора Цикл
	
		НоваяСтрока[СтруктураВыбораСтрока.Ключ] = СтруктураВыбораСтрока.Значение;
	
	КонецЦикла; 
	
	Элементы.ФормаПеренестиВЗапись.Доступность = Результаты.Количество() > 0;

КонецПроцедуры

&НаКлиенте
Процедура ВыборСтрокиСпискаИстории()

	ТекущаяСтрока = Элементы.СписокИстории.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрВыбора = Новый Структура("ИмяВопроса, Время", 
		ТекущаяСтрока.Вопрос, ТекущаяСтрока.Время);
	
	ДобавитьРезультатВСписок(ПараметрВыбора);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УсловноеОформлениеВажности();
	УсловноеОформлениеВидаЗаписи();
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеВажности()

	//ПрименитьУсловноеОфомление("Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Обычное	, "Дата", "Важность_Обычное",, WebЦвета.НейтральноЗеленый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Важное	, "Период", "Важность_Важное",, WebЦвета.Оранжевый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Особое	, "Период", "Важность_Особое",, WebЦвета.БледноБирюзовый);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеВидаЗаписи()

	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Обычный	, "Дата", "ВидЗаписи_Обычный",, WebЦвета.Лосось);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Личный	, "Вопрос", "ВидЗаписи_Личный",, WebЦвета.БледноКрасноФиолетовый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Рабочий	, "Вопрос", "ВидЗаписи_Рабочий",, WebЦвета.ПесочноКоричневый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Общий	, "Вопрос", "ВидЗаписи_Общий",, WebЦвета.СветлоНебесноГолубой);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Прочее	, "Вопрос", "ВидЗаписи_Прочее",, WebЦвета.БледноЗолотистый);
	
КонецПроцедуры
