
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УсловноеОформлениеВажности();
	УсловноеОформлениеВидаЗаписи();
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеВажности()

	// Список Записей
	//ПрименитьУсловноеОфомление("Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Обычное	, "Дата", "Важность_Обычное",, WebЦвета.НейтральноЗеленый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Важное	, "Дата", "Важность_Важное",, WebЦвета.Оранжевый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Особое	, "Дата", "Важность_Особое",, WebЦвета.БледноБирюзовый);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеВидаЗаписи()

	// Список Записей
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Обычный	, "Дата", "ВидЗаписи_Обычный",, WebЦвета.Лосось);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Личный	, "Автор", "ВидЗаписи_Личный",, WebЦвета.БледноКрасноФиолетовый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Рабочий	, "Автор", "ВидЗаписи_Рабочий",, WebЦвета.ПесочноКоричневый);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Общий	, "Автор", "ВидЗаписи_Общий",, WebЦвета.СветлоНебесноГолубой);
	дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(Список.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Прочее	, "Автор", "ВидЗаписи_Прочее",, WebЦвета.БледноЗолотистый);
	
КонецПроцедуры