
&НаКлиенте
Процедура ПеренестиВЗапись(Команда)
	
	Закрыть(ПодготовитьРезультатКПереносуВЗапись(ВладелецФормы.УникальныйИдентификатор));
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьРезультатКПереносуВЗапись(ИДВладельца)

	АдресТаблицы = ПоместитьВоВременноеХранилище(Результаты.Выгрузить(), ИДВладельца);
	Результат = Новый Структура("АдресТаблицыВыбора", АдресТаблицы);
	
	Возврат Результат;

КонецФункции


&НаКлиенте
Процедура СписокИсторииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборСтрокиСпискаИстории();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРезультатВСписок(СтруктураВыбора)

	НоваяСтрока 				= Результаты.Добавить();
	Для каждого СтруктураВыбораСтрока Из СтруктураВыбора Цикл
	
		НоваяСтрока[СтруктураВыбораСтрока.Ключ] = СтруктураВыбораСтрока.Значение;
	
	КонецЦикла; 
	//НоваяСтрока.ИмяРезультата 	= СтруктураВыбора.ИмяРезультата;
	//НоваяСтрока.Параметр        = СтруктураВыбора.Параметр;
	//НоваяСтрока.Значение        = СтруктураВыбора.Значение;
	
	Элементы.ФормаПеренестиВЗапись.Доступность = Результаты.Количество() > 0;

КонецПроцедуры

&НаКлиенте
Процедура ВыборСтрокиСпискаИстории()

	ТекущаяСтрока = Элементы.СписокИстории.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрВыбора = Новый Структура("Время, ИмяЭмоции, Интенсивность, Длительность, Комментарий", 
		ТекущаяСтрока.Время, ТекущаяСтрока.ИмяЭмоции, ТекущаяСтрока.Интенсивность, ТекущаяСтрока.Длительность, ТекущаяСтрока.Комментарий);
	
	ДобавитьРезультатВСписок(ПараметрВыбора);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	дфРезультаты = ДанныеФормыВЗначение(Результаты, Тип("ТаблицаЗначений"));
	
	ЗаполнитьЗаголовкиКолонокТабличногоДокумента(дфРезультаты.Колонки);
	
	УсловноеОформлениеВажности();
	УсловноеОформлениеВидаЗаписи();
	
КонецПроцедуры

//	пКолонки - КоллекцияКолонокТаблицыЗначений - Напр., ТЗ.Колонки
&НаСервере
Функция ЗаполнитьЗаголовкиКолонокТабличногоДокумента(пКолонки)

	лНомерТекущейКолонки = 0;
	Для каждого лКолонка Из пКолонки Цикл
	
		лНомерТекущейКолонки 			= лНомерТекущейКолонки + 1;
		
		//Получаем ячейки с данными
		лТабличныйДокументЯчейка 		= ТабличныйДокумент.Область("R1" + "C" + Строка(лНомерТекущейКолонки));
		
		//Заполняем заголовки колонок
		лТабличныйДокументЯчейка.Текст = лКолонка.Имя;
		лТабличныйДокументЯчейка.Шрифт = Новый Шрифт(,, Истина);
	
	КонецЦикла; 

КонецФункции // ЗаполнитьЗаголовкиКолонокТабличногоДокумента()
 

&НаСервере
Процедура УсловноеОформлениеВажности()

	//ПрименитьУсловноеОфомление("Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Обычное	, "Дата", "Важность_Обычное",, WebЦвета.НейтральноЗеленый);
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Важное	, "Период", "Важность_Важное",, WebЦвета.Оранжевый);
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "Важность", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВажность.Особое	, "Период", "Важность_Особое",, WebЦвета.БледноБирюзовый);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеВидаЗаписи()

	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Обычный	, "Дата", "ВидЗаписи_Обычный",, WebЦвета.Лосось);
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Личный	, "ИмяЭмоции", "ВидЗаписи_Личный",, WebЦвета.БледноКрасноФиолетовый);
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Рабочий	, "ИмяЭмоции", "ВидЗаписи_Рабочий",, WebЦвета.ПесочноКоричневый);
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Общий	, "ИмяЭмоции", "ВидЗаписи_Общий",, WebЦвета.СветлоНебесноГолубой);
	//дОбщиеФункцииСервер.ПрименитьУсловноеОфомление(СписокИстории.УсловноеОформление.Элементы, "ВидЗаписи", ВидСравненияКомпоновкиДанных.Равно, Перечисления.дВидЗаписи.Прочее	, "ИмяЭмоции", "ВидЗаписи_Прочее",, WebЦвета.БледноЗолотистый);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Результаты.Количество() > 0 Тогда
		Ответ = Вопрос("В итоговой таблице уже есть строки. Очистить их?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Проверка заполнения табличной части");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Результаты.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ПрочитатьДанныеТабличногоДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеТабличногоДокумента()
	
	лДанныеТабличногоДокумента = Новый ТаблицаЗначений;
	
	//Получаем колонки
	лСтруктураДанных 	= Новый Структура();
	НомерТекущейКолонки = 0;
	Для лНомерТекущейКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		
		//Получаем ячейки с данными
		лТабличныйДокументЯчейка 	= ТабличныйДокумент.Область("R1" + "C" + Строка(лНомерТекущейКолонки));
		
		//Заполняем структуру колонок и их номеров
		лСтруктураДанных.Вставить(лТабличныйДокументЯчейка.Текст, лНомерТекущейКолонки);
		
	КонецЦикла;
	
	//Заполняем ТаблицуЗначений данными из ТабличногоДокумента
	Для лНомерТекущейСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл //лНомерТекущейСтроки = 1 это имена колонок
		
		НоваяСтрока 				= Результаты.Добавить();
		Для каждого лСтруктураДанныхЭлем Из лСтруктураДанных Цикл
			
			//Получаем ячейки с данными из ТабличногоДокумента: 
			//лСтруктураДанныхЭлем.Ключ = Имя колонки
			//лСтруктураДанныхЭлем.Значение = Номен колонки
			лТабличныйДокументЯчейка 	= ТабличныйДокумент.Область("R" + Формат(лНомерТекущейСтроки, "ЧГ=") + "C" + Строка(лСтруктураДанныхЭлем.Значение));
			
			лИмяКолонки 		= лСтруктураДанныхЭлем.Ключ;
			лЗначениеКолонки 	= лТабличныйДокументЯчейка.Текст;
			
			Если ЗначениеЗаполнено(лЗначениеКолонки) Тогда
				Если лИмяКолонки = "Время" Тогда
					лЗначениеКолонки = СтрЗаменить(лЗначениеКолонки, ":", "");
					Если СтрДлина(лЗначениеКолонки) = 2 Тогда
						лЗначениеКолонки = лЗначениеКолонки + "00";
					ИначеЕсли СтрДлина(лЗначениеКолонки) = 3 Тогда
						лЗначениеКолонки = лЗначениеКолонки + "0";
					КонецЕсли;
					
					Попытка
					
						лЗначениеКолонки = Дата("00010101" + лЗначениеКолонки);	
					
					Исключение
						лЗначениеКолонки = "";
					КонецПопытки;
				ИначеЕсли лИмяКолонки = "ИмяЭмоции" Тогда
					лЗначениеКолонки = Справочники.дЭмоции.НайтиПоНаименованию(лЗначениеКолонки);
				КонецЕсли;
			КонецЕсли;
			
			//Заполняем итоговую таблицу значений данными из ТабличногоДокумента
			НоваяСтрока[лИмяКолонки] = лЗначениеКолонки;
		
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры
