
#Область ПрограммныйИнтерфейс

// См. описание функции "Справочники.КлассификаторКонтактов.КлассификаторКонтактовЗаполнен"
Функция КлассификаторКонтактовЗаполнен() Экспорт
	
	Возврат Справочники.КлассификаторКонтактов.ТекущееСостояние().КлассификаторКонтактовЗаполнен;
	
КонецФункции

// См. описание функции "Справочники.КлассификаторКонтактов.СписокАвтоПодбора"
Функция СписокАвтоПодбораКонтакта(Знач СтрокаПоиска, Знач ТолькоКлассификатор, Знач ТипЗначения, Знач Отбор = Неопределено) Экспорт
	
	Возврат Справочники.КлассификаторКонтактов.СписокАвтоПодбора(СтрокаПоиска, ТолькоКлассификатор, ТипЗначения, Отбор);
	
КонецФункции

Функция РасписаниеРегламентногоЗадания(Знач ОбластьДоступа) Экспорт
	
	РегламентноеЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(ОбластьДоступа);
	Возврат РегламентноеЗадание.Расписание;
	
КонецФункции

Процедура УстановитьРасписаниеРегламентногоЗадания(Знач Расписание, Знач ОбластьДоступа) Экспорт
	
	РегламентноеЗадание = РегистрыСведений.ЗаданияОбменаСGoogle.РегламентноеЗадание(ОбластьДоступа);
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РегламентноеЗадание.Расписание = Расписание;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаПолученияФормыУчетнойЗаписиЭлектроннойПочты(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ОбменСGoogle.ОбработкаПолученияФормыУчетнойЗаписиЭлектроннойПочты(
	Источник,
	ВидФормы,
	Параметры,
	ВыбраннаяФорма,
	ДополнительнаяИнформация,
	СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
