
Процедура ПередЗаписью(Отказ)
	
	// Данные для нового документа
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда // Т.е. новый элемент
		Создан = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор 	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	//Коварно проверять на заполненность ТЧ "МентальнаяКарта",
	//т.к. для корневого элемента ЭлементИД равен пустому значению. Но попробуем
	Для каждого лСтрока Из МентальнаяКарта Цикл
		
		ПустойИД 	= Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Если НЕ лСтрока.НомерСтроки = 1 И лСтрока.ЭлементИД = ПустойИД Тогда
			лСтрока.ЭлементИД 	= Новый УникальныйИдентификатор();
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры
